{
  "translation": {
    "home-page": "Página inicial",
    "about-me": "Sobre mim",
    "projects": "Projetos",
    "contact": "Contato",

    "credits": "Feito por Leonardo Fonseca",
    "language-text": "Tecnologias em que desenvolvo.",

    "home-title-one": "Transformando linhas de",
    "home-title-two": "código em soluções",
    "home-title-three": "inovadoras e funcionais",

    "about-me-description":"Sou Leonardo Fonseca, formado pela UNIFESP e apaixonado por tecnologia. Com uma abordagem focada e diligente, busco constantemente crescimento pessoal e profissional. Minha formação acadêmica e entusiasmo por tecnologia me permitem enfrentar desafios de forma eficaz e inovadora. Minhas principais habilidades são em NestJS, ReactJS, TypeScript e TDD, áreas nas quais me dedico a desenvolver soluções impactantes e de alta qualidade.",

    "projects-title": "Meus projetos.",
    "projects-text": "Explorando minha paixão pelo desenvolvimento, estou constantemente me esforçando para melhorar minhas habilidades. Confira meus projetos recentes para testemunhar meu compromisso em evoluir como desenvolvedor.",
    "projects-text-2": "Clique na imagem do projeto que te interessar para acessá-lo!",

    "certificate-title": "Certificados",

    "stock-title": "Registro de ações",
    "stock-text": "Neste projeto, optei por aplicar as tecnologias mais modernas do mercado, utilizando TypeScript em todo o seu desenvolvimento. No lado do servidor, escolhi o framework NestJS, conhecido por sua escalabilidade e estrutura modularizada. Para a comunicação com o banco de dados, escolhi o Prisma, que oferece uma interface segura e prática. O banco de dados PostgreSQL foi selecionado por sua confiabilidade e desempenho. Quanto à hospedagem, optei por utilizar o serviço Neon para o banco de dados PostgreSQL. Para o front-end, usei a biblioteca React para me dar versatilidade e praticidade na estruturação das páginas.",

    "inventory-title": "Estoque",
    "inventory-text": "No projeto de estoque, utilizei nodeJS, MySQL e hospedei, tanto o banco de dados quanto o próprio servidor, na AWS",

    "task-title": "Organizador de Tarefas",
    "task-text": "Desenvolvi um organizador de tarefas intuitivo e versátil, utilizando HTML, CSS e JavaScript. Os usuários podem gerenciar suas tarefas de forma eficiente, adicionando, removendo e marcando tarefas concluídas em uma interface amigável e funcional.",

    "calc-title": "Calculadora",
    "calc-text": "Criei uma calculadora funcional. Esta aplicação combina desenvolvimento HTML, CSS e lógica JavaScript, demonstrando meu domínio das tecnologias web. Explore a simplicidade e eficiência desta calculadora desenvolvida com paixão e habilidade.",

    "imagine-title": "Imgaine and action",
    "imagine-text": "Imagine and action é um site com um jogo de adivinhação de palavras feito com ReactJS. É um projeto feito como um freela para um cliente, por isso não posso publicar o código publicamente. Mas você pode acessar o site clicando na imagem.",

    "jet-title": "JeT",
    "jet-text": "Conheça o JeT: um aplicativo Python criado para simplificar a organização de jogos entre amigos. Com apenas alguns cliques, o aplicativo distribui os participantes em equipes de forma aleatória, formando as equipes automaticamente.",
    
    "posts-title": "Posts (TDD)",
    "posts-text": "Este projeto foi feito com o intuito de exercitar o método de TDD, de forma que os testes orientaram o desenvolvimento, garantindo um ambiente de desenvolvimento correto e de qualidade.",

    "portfolio-title": "Portfólio",
    "portfolio-text": "Este portfólio foi desenvolvido em ReactJS, com a integração da biblioteca i18next para fornecer suporte à internacionalização. O site é totalmente responsivo e foi projetado para exibir meus projetos e habilidades de forma clara e acessível. O código-fonte está disponível no GitHub, e você pode acessá-lo clicando na imagem abaixo.",
    
    "bot-mail-title": "Bot-mail",
    "bot-mail-text": "Nesse projeto fiz um ensaio de como utilizar uma api de uma LLM para se comportar como um analista de e-mails, ele vê se o e-mail é importante ou não e sugere uma resposta",

    "chordLearner-title": "Chord Learner",
    "chordLearner-text": "Este é um projeto que fiz por que queria melhorar minhas habilidades de violçao, então, conversando com alguns amigos resolvi fazer um site que pudesse me ajudar de forma simples"
  }
}
